import type { Language } from '../types';

export const alphabets: Record<Language, readonly string[]> = {
  en: [
    'A', 'B', 'C', 'D', 'E', 'F', 'G',
    'H', 'I', 'J', 'K', 'L', 'M', 'N',
    'O', 'P', 'Q', 'R', 'S', 'T', 'U',
    'V', 'W', 'X', 'Y', 'Z',
  ],
  he: [
    'א', 'ב', 'ג', 'ד', 'ה', 'ו',
    'ז', 'ח', 'ט', 'י', 'כ', 'ל',
    'מ', 'נ', 'ס', 'ע', 'פ', 'צ',
    'ק', 'ר', 'ש', 'ת',
  ],
  ar: [
    'ا', 'ب', 'ت', 'ث', 'ج', 'ح', 'خ',
    'د', 'ذ', 'ر', 'ز', 'س', 'ش', 'ص',
    'ض', 'ط', 'ظ', 'ع', 'غ', 'ف', 'ق',
    'ك', 'ل', 'م', 'ن', 'ه', 'و', 'ي',
  ],
  ru: [
    'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж',
    'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О',
    'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц',
    'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю',
    'Я',
  ],
} as const;

export const alphabetGridColumns: Record<Language, number> = {
  en: 7,
  he: 6,
  ar: 7,
  ru: 8,
};
